In [37]:
!pip install numpy
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\users\shreenandan sahu\appdata\roaming\python\python311\site-packages (1.25.2)

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\shreenandan sahu\appdata\roaming\python\python311\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\shreenandan sahu\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\shreenandan sahu\appdata\roaming\python\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\shreenandan sahu\appdata\roaming\python\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\shreenandan sahu\appdata\roaming\python\python311\site-packages (from pandas) (1.25.2)
Requirement already satisfied: six>=1.5 in c:\users\shreenandan sahu\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [38]:
import numpy as np
import pandas as pd

In [39]:
dict={"name":['Shreenandan','Suraksha','Nirupama','pradeepta'],"City":['Cuttack','Karkala','Saleipur','Tangi'],"marks":[99,98,97,96],"mark":[49,95,77,69]}
df=pd.DataFrame(dict)
df

          name      City  marks  mark
0  Shreenandan   Cuttack     99    49
1     Suraksha   Karkala     98    95
2     Nirupama  Saleipur     97    77
3    pradeepta     Tangi     96    69

In [40]:
df.to_csv("data.csv",index=False)

In [41]:
df.head(2)

          name     City  marks  mark
0  Shreenandan  Cuttack     99    49
1     Suraksha  Karkala     98    95

In [42]:

df.tail(2)

        name      City  marks  mark
2   Nirupama  Saleipur     97    77
3  pradeepta     Tangi     96    69

In [43]:
df.describe()

           marks       mark
count   4.000000   4.000000
mean   97.500000  72.500000
std     1.290994  19.070046
min    96.000000  49.000000
25%    96.750000  64.000000
50%    97.500000  73.000000
75%    98.250000  81.500000
max    99.000000  95.000000

In [46]:
df=pd.read_csv("read.csv")
df.head(3)

    Name  Age  Salary
0  KDJFH   34   52945
1  ALXYP   41   88401
2  QWERT   23   73822

In [50]:
df['Name'][2]="sonu"

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_20088\2325198577.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2]="sonu"

In [51]:
df

    Name  Age  Salary
0  KDJFH   34   52945
1  ALXYP   41   88401
2   sonu   23   73822
3  ZXCVB   59   31011
4  YUIOP   29   65432
5  PLMNB   36   98900
6  GHJKL   42   47852
7  ASDFG   31   59999
8  BNMVK   28   85312
9  TREWA   47   77450

In [53]:
df.to_csv("read.csv",index=False)

In [80]:
x=pd.Series(np.random.rand(20))
x.head(10)

0    0.052061
1    0.395197
2    0.851398
3    0.038621
4    0.894681
5    0.936236
6    0.847580
7    0.684093
8    0.492633
9    0.299473
dtype: float64

In [84]:
y=pd.DataFrame(np.random.rand(50,5))
y.head(4)

          0         1         2         3         4
0  0.238710  0.256265  0.777614  0.656454  0.785301
1  0.371495  0.556523  0.802311  0.557046  0.783612
2  0.454857  0.225370  0.643219  0.608670  0.587606
3  0.048911  0.056679  0.877761  0.658409  0.412425

In [89]:
y.describe()

               0          1          2          3          4
count  50.000000  50.000000  50.000000  50.000000  50.000000
mean    0.521645   0.501993   0.521394   0.510393   0.456842
std     0.268649   0.288872   0.292711   0.265393   0.289428
min     0.048911   0.037991   0.024106   0.007356   0.009059
25%     0.307226   0.258276   0.253422   0.316129   0.207093
50%     0.589226   0.552153   0.507756   0.550710   0.414208
75%     0.701999   0.755197   0.804726   0.664541   0.698772
max     0.995944   0.960139   0.999640   0.962638   0.990433